SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1052_EVK/LCDConf.c
typedef enum {
  BLEND_MODE_NORMAL     = (1 << 0),
  BLEND_MODE_MULTIPLY   = (1 << 1),
  BLEND_MODE_PORTERDUFF = (1 << 2),
} BLEND_MODE;

typedef struct {
  void      * p;
  int         xSize, ySize;
  int         BytesPerLine;
  bool        OverwriteAlpha;
  BUFFER_TYPE Type;
  union {
    pxp_output_pixel_format_t Out;
    pxp_ps_pixel_format_t     Ps;
    pxp_as_pixel_format_t     As;
  } Format;
} BUFFER_OBJ;

typedef struct {
  BLEND_MODE                   Mode;
  U8                           Alpha;
  pxp_porter_duff_blend_mode_t PorterDuffMode;
} PXP_BLEND_INFO;

typedef struct {
  int              x, y;
  int              xSize, ySize;
  BUFFER_OBJ     * pOutputBuffer;
  BUFFER_OBJ     * pProcessSurface;
  BUFFER_OBJ     * pAlphaSurface;
  PXP_BLEND_INFO * pBlend;
} LCD_PXP_DRAW_CONTEXT;

typedef struct {
  int * pxSizeRoundUp;
  int * pySizeRoundUp;
  int * pxSizeRoundDown;
  int * pySizeRoundDown;
} LCD_PXP_SIZE_CONTEXT;

/*********************************************************************
*
*       Static data
*
**********************************************************************
*/
#define BUFFER_PLACEMENT   __attribute__ ((section (".SDRAM1.GUI_RAM")))

U8                  _aVRAM0[XSIZE_PHYS * YSIZE_PHYS * NUM_BUFFERS * NUM_VSCREENS * LCD_BYTES_PER_PIXEL] BUFFER_PLACEMENT;
static volatile int _PendingBuffer = -1;
static volatile int _BackBuffer    =  0;
//
// Buffer used for various PXP operations requiring two buffers, as well as CopyRect().
//
#if USE_PXP_BUFFER
  U8 _aBufferPXP[XSIZE_PHYS * YSIZE_PHYS * LCD_BYTES_PER_PIXEL] BUFFER_PLACEMENT;
#endif
//
// Temporarily allocated buffer
//
static void * _pBuffer;
//
// Config objects used for PXP operations 
//
static LCD_PXP_DRAW_CONTEXT _PXP_Context;
static PXP_BLEND_INFO       _PXP_Blend;
static BUFFER_OBJ           _PXP_aBuffer[3]; // Output buffer, process surface, alpha surface
//
// Currently used display rotation for PXP.
//
static pxp_rotate_degree_t _PXP_Rotation;
//
// Clock config
//
const clock_arm_pll_config_t armPllConfig  = {.loopDivider = 100U};
const clock_sys_pll_config_t sysPllConfig  = {.loopDivider = 1U};
const clock_usb_pll_config_t usb1PllConfig = {.loopDivider = 0U};
//
// Buffer array
//
static U32 _aBufferAddress[NUM_BUFFERS] = {
  VRAM_ADDR,
  #if (NUM_BUFFERS > 1)
    VRAM_ADDR + XSIZE_PHYS * YSIZE_PHYS * LCD_BYTES_PER_PIXEL,
  #endif
  #if (NUM_BUFFERS > 2)
    VRAM_ADDR + XSIZE_PHYS * YSIZE_PHYS * LCD_BYTES_PER_PIXEL * 2
  #endif
};
//
// Semaphores
//
#if (USE_OS == 1)
  //
  // Semaphore definitions.
  //
  static SEMAPHORE_TYPE _Sema_WaitForPXP;
  static SEMAPHORE_TYPE _Sema_WaitForVSYNC;
  //
  // Handles/Pointers to above semaphores.
  //
  static SEMAPHORE_HANDLE_TYPE _hSema_WaitForPXP   = MAKE_SEMAPHORE_HANDLE(_Sema_WaitForPXP);
  static SEMAPHORE_HANDLE_TYPE _hSema_WaitForVSYNC = MAKE_SEMAPHORE_HANDLE(_Sema_WaitForVSYNC);
#endif

/*********************************************************************
*
*       Prototypes
*
**********************************************************************
*/
static void _LCD_PXP_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat);
static void _LCD_PXP_Index2ColorBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat);

/*********************************************************************
*
*       Defines
*
**********************************************************************
*/
//
// PXP macros
//
#define PXP_PS_InvalidFormat           kPXP_PsPixelFormatY4     // Unused format, used here as invalid format flag
#define PXP_DisableSurface(surf)       PXP_Set##surf##SurfacePosition(PXP, 0xFFFFu, 0xFFFFu, 0u, 0u)
#define PXP_DisableProcessSurface()    PXP_DisableSurface(Process)
#define PXP_DisableAlphaSurface()      PXP_DisableSurface(Alpha)

#define DEFINE_PXP_COLOR2INDEX(SUFFIX, FORMAT)                                                                     \
  static void _LCD_PXP_Color2IndexBulk_##SUFFIX(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex) { \
    _LCD_PXP_Color2IndexBulk(pColor, pIndex, NumItems, SizeOfIndex, FORMAT);                                       \
  }

#define DEFINE_PXP_INDEX2COLOR(SUFFIX, FORMAT)                                                                     \
  static void _LCD_PXP_Index2ColorBulk_##SUFFIX(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex) { \
    _LCD_PXP_Index2ColorBulk(pIndex, pColor, NumItems, SizeOfIndex, FORMAT);                                       \
  }

#define DEFINE_PXP_COLORCONV(SUFFIX, FORMAT)  \
  DEFINE_PXP_COLOR2INDEX(SUFFIX, FORMAT)      \
  DEFINE_PXP_INDEX2COLOR(SUFFIX, FORMAT)

#define GUI_PXP_SETCOLORCONV(FORMAT)   GUICC_##FORMAT##_SetCustColorConv(_LCD_PXP_Color2IndexBulk_##FORMAT, _LCD_PXP_Index2ColorBulk_##FORMAT)

/*********************************************************************
*
*       Static code: General helper functions
*
**********************************************************************
*/
/*********************************************************************
*
*       _Malloc
*/
static void * _Malloc(U32 NumBytes) {
#if USE_PXP_BUFFER
  if (NumBytes > sizeof(_aBufferPXP)) {
    _pBuffer = NULL;
  }
  _pBuffer = _aBufferPXP;
#else
  GUI_HMEM hMem;

  hMem = GUI_ALLOC_AllocNoInit(NumBytes);
  if (hMem == 0) {
    return NULL;
  }
  GUI_LOCK();
  _pBuffer = GUI_ALLOC_LockH(hMem);
#endif
  return _pBuffer;
}

/*********************************************************************
*
*       _Free
*/
static void _Free(void * p) {
#if USE_PXP_BUFFER
  GUI_USE_PARA(p);
#else
  GUI_HMEM hMem;
  
  if (p) {
    hMem = GUI_ALLOC_p2h(p);
    GUI_ALLOC_UnlockH(p);
    GUI_UNLOCK();
    GUI_ALLOC_Free(hMem);
  }
#endif
}

/*********************************************************************
*
*       _GetMemdevParams
*/
static void _GetMemdevParams(GUI_MEMDEV_Handle hMem, void ** pp, int * pxSize, int * pySize, int * pBPP) {
  *pp     = GUI_MEMDEV_GetDataPtr(hMem);
  *pxSize = GUI_MEMDEV_GetXSize(hMem);
  *pySize = GUI_MEMDEV_GetYSize(hMem);
  *pBPP   = GUI_MEMDEV_GetBitsPerPixel(hMem);
}

/*********************************************************************
*
*       Static code: Semaphore handling
*
**********************************************************************
*/
#if (USE_OS == 1)
/*********************************************************************
*
*       _Semaphore_Take
*/
static void _Semaphore_Take(SEMAPHORE_HANDLE_TYPE hSema) {
#if (OS == EMBOS)
  OS_SEMAPHORE_TakeBlocked(hSema);
#endif
#if (OS == FREERTOS)
  xSemaphoreTake(hSema, portMAX_DELAY);
#endif
}

/*********************************************************************
*
*       _Semaphore_Create
*/
static void _Semaphore_Create(SEMAPHORE_HANDLE_TYPE * phSema) {
#if (OS == EMBOS)
  OS_SEMAPHORE_Create(*phSema, 0);
#endif
#if (OS == FREERTOS)
  *phSema = xSemaphoreCreateBinary();
#endif
}

/*********************************************************************
*
*       _Semaphore_Give
*/
static void _Semaphore_Give(SEMAPHORE_HANDLE_TYPE hSema) {
#if (OS == EMBOS)
  OS_EnterInterrupt();
  OS_SEMAPHORE_Give(hSema);
  OS_LeaveInterrupt();
#endif
#if (OS == FREERTOS)
  xSemaphoreGive(hSema);
#endif
}
#endif

/*********************************************************************
*
*       Static code: PXP helper functions
*
**********************************************************************
*/
/*********************************************************************
*
*       _Swap
*/
static void _Swap(int * p0, int * p1) {
  int Temp;

  Temp = *p0;
  *p0  = *p1;
  *p1  = Temp;
}

/*********************************************************************
*
*       _SwapSizesOnDemand
*/
static void _SwapSizesOnDemand(int * pxSize, int * pySize) {
  if (LCD_GetSwapXY()) {
    _Swap(pxSize, pySize);
  }
}

/*********************************************************************
*
*       _PXP_InitOperation
*/
static void _PXP_InitOperation(void) {
  //
  // Clear data cache before operation to avoid artefacts on the screen.
  //
  GUI_DCACHE_Clear(0);
  PXP_Reset(PXP);
  //
  // Use interrupt with semaphores to decrease CPU load.
  //
#if (USE_OS == 1)
  PXP_EnableInterrupts(PXP, kPXP_CompleteInterruptEnable);
#endif
  //
  // Disable CSC module, enabled by default.
  // 16x16 blocks for better performance.
  //
  PXP_EnableCsc1(PXP, false);
  PXP_SetProcessBlockSize(PXP, kPXP_BlockSize16);
}

/*********************************************************************
*
*       _PXP_StartOperation
*/
static void _PXP_StartOperation(void) {
  //
  // Start and wait for process to complete.
  //
  PXP_Start(PXP);
#if (USE_OS == 1)
  _Semaphore_Take(_hSema_WaitForPXP);
#else
  while (!(kPXP_CompleteFlag & PXP_GetStatusFlags(PXP)));
  PXP_ClearStatusFlags(PXP, kPXP_CompleteFlag);
#endif
  //
  // Free temporary buffer if there is one.
  //
  if (_pBuffer) {
    _Free(_pBuffer);
    _pBuffer = NULL;
  }
}

/*********************************************************************
*
*       _PXP_ScalingParamValid
*/
static bool _PXP_ScalingParamValid(int inputDimension, int outputDimension) {
  U32 scaleFact = ((U32)inputDimension << 12U) / outputDimension;
  
  if ((scaleFact >= (16UL << 12U)) || scaleFact == 0) {
    return false;
  }
  return true;
}

/*********************************************************************
*
*       _PXP_SetPorterDuffMode
*/
static void _PXP_SetPorterDuffMode(pxp_porter_duff_blend_mode_t Mode) {
  pxp_porter_duff_config_t pd_cfg;

  PXP_GetPorterDuffConfig(Mode, &pd_cfg);
  PXP_SetPorterDuffConfig(PXP, &pd_cfg);
}

/*********************************************************************
*
*       _Log2PhysCoords
*/
static void _Log2PhysCoords(int x, int y, int xSize, int ySize, int * pxPhys, int * pyPhys) {
  *pxPhys = 0;
  *pyPhys = 0;
  switch (_PXP_Rotation) {
  case kPXP_Rotate0:
    *pxPhys = x;
    *pyPhys = y;
    break;
  case kPXP_Rotate90:
    *pxPhys = XSIZE_PHYS - y - ySize;
    *pyPhys = x;
    break;
  case kPXP_Rotate180:
    *pxPhys = XSIZE_PHYS - x - xSize;
    *pyPhys = YSIZE_PHYS - y - ySize;
    break;
  case kPXP_Rotate270:
    *pxPhys = y;
    *pyPhys = YSIZE_PHYS - x - xSize;
    break;
  }
}

/*********************************************************************
*
*       _Phys2LogCoords
*/
static void _Phys2LogCoords(int * px0, int * py0, int * px1, int * py1) {
  int Temp;

