SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1052_EVK/LCDConf.c
  _GetMemdevParams(hMem, &pDst, &xSize, &ySize, &BitsPerPixel);
  BytesPerPixel = BitsPerPixel / 8;
  if (BitsPerPixel != 32) {
    return 1;
  }
  //
  // Allocate temp. buffer
  //
  NumBytes = xSize * ySize * BytesPerPixel;
  pBuffer  = (U32 *)_Malloc(NumBytes);
  if (pBuffer == NULL) {
    return 1;
  }
  //
  // Step 1: Fill buffer with given color and given alpha value
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBuffer(pBuffer, xSize * BytesPerPixel, xSize, ySize, true);
  //
  // No AS needed.
  //
  PXP_DisableAlphaSurface();
  //
  // Disable PS, generate the color instead.
  //
  PXP_DisableProcessSurface();
  PXP_SetProcessSurfaceBackGroundColor(PXP, Color);
  //
  _PXP_StartOperation();
  //
  // Step 2: Blend temp. buffer over memory device.
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBufferEx(pDst, xSize * BytesPerPixel, xSize, ySize, false, kPXP_OutputPixelFormatARGB8888);
  //
  // Configure memdev as PS.
  //
  _PXP_ConfigProcessSurfaceEx(pDst, xSize * BytesPerPixel, xSize, ySize, kPXP_PsPixelFormatRGB888);
  //
  // Use temp. buffer as AS.
  //
  _PXP_ConfigAlphaSurfaceEx(pBuffer, xSize * BytesPerPixel, xSize, ySize, kPXP_AsPixelFormatARGB8888);
  //
  // Set Porter-Duff blending to SrcOver.
  //
  _PXP_ConfigAlphaBlendMultiply(BlendIntens);
  _PXP_SetPorterDuffMode(kPXP_PorterDuffOver);
  _PXP_StartOperation();
  return 0;
}

/*********************************************************************
*
*       _LCD_PXP_GetPsFormatFromBitmap
*/
static pxp_ps_pixel_format_t _LCD_PXP_GetPsFormatFromBitmap(const GUI_BITMAP * pBitmap) {
  if (pBitmap->pMethods == GUI_DRAW_BMPM8888I) {
    return kPXP_PsPixelFormatRGB888;
  }
  if (pBitmap->pMethods == GUI_DRAW_BMPM565) {
    return kPXP_PsPixelFormatRGB565;
  }
  if (pBitmap->pMethods == GUI_DRAW_BMPM444_12) {
    return kPXP_PsPixelFormatRGB444;
  }
  if (pBitmap->pMethods == GUI_DRAW_BMP555) {
    return kPXP_PsPixelFormatRGB555;
  }
  return PXP_PS_InvalidFormat;
}

/*********************************************************************
*
*       _LCD_PXP_DrawBitmapEx
*/
static int _LCD_PXP_DrawBitmapEx(const GUI_BITMAP * pBitmap, int x0, int y0, int xMag, int yMag) {
  pxp_ps_pixel_format_t Fmt;
  pxp_flip_mode_t       FlipMode;
  int                   xSizeScaled;
  int                   ySizeScaled;
  int                   DevClass;
  bool                  TwoSteps;
  U32                   NumBytes;
  void                * pBuffer;
  pxp_rotate_degree_t   Rotation = _PXP_Rotation;
  bool                  Scaling;
  int                   xSizeRD, ySizeRD, xSizeRU, ySizeRU;
  LCD_PXP_SIZE_CONTEXT  Ctx = { &xSizeRU, &ySizeRU, &xSizeRD, &ySizeRD };
  int                   Pitch;

  //
  // We only want to write into the frame buffer or the current MEMDEV.
  //
  DevClass = GUI_DEVICE_GetDeviceClass();
  if ((DevClass != DEVICE_CLASS_DRIVER) && (DevClass != DEVICE_CLASS_MEMDEV)) {
    return 1;
  }
  //
  // Convert bitmap format to processing surface format. If the format is not supported by PXP we abort.
  //
  Fmt = _LCD_PXP_GetPsFormatFromBitmap(pBitmap);
  if (Fmt == PXP_PS_InvalidFormat) {
    return 1;
  }
  //
  // Retrieve flip mode to be used.
  // We also always need positive scaling factors.
  //
  FlipMode  = kPXP_FlipDisable;
  if (xMag < 0) {
    FlipMode |= kPXP_FlipHorizontal;
    xMag      = -xMag;
  }
  if (yMag < 0) {
    FlipMode |= kPXP_FlipVertical;
    yMag      = -yMag;
  }
  xSizeScaled = (pBitmap->XSize * xMag) / 1000;
  ySizeScaled = (pBitmap->YSize * yMag) / 1000;
  //
  // Do operation by software if desired size is too small or too large.
  //
  if (!(_PXP_ScalingParamValid(pBitmap->XSize, xSizeScaled) && _PXP_ScalingParamValid(pBitmap->YSize, ySizeScaled))) {
    return 1;
  }
  //
  // In case we output into a memory device, it must not be rotated.
  //
  if (DevClass == DEVICE_CLASS_MEMDEV) {
    Rotation = kPXP_Rotate0;
  }
  //
  // Vertical flipping (same as rotation) and scaling cannot be done in one step.
  //
  Scaling  = ((xMag != 1000) || (yMag != 1000)) ? true : false;
  TwoSteps = ((Scaling && (FlipMode & kPXP_FlipVertical)) || (Rotation != kPXP_Rotate0)) ? true : false;
  _PXP_InitOperation();
  if (!TwoSteps) {
    //
    // Set flipping mode and rotation.
    //
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, Rotation, FlipMode);
    //
    // Config scaling params for PS.
    //
    PXP_SetProcessSurfaceScaler(PXP, pBitmap->XSize, pBitmap->YSize, xSizeScaled, ySizeScaled);
    //
    // Configure bitmap as PS.
    //
    PXP_DisableAlphaSurface();
    _PXP_ConfigProcessSurfaceEx((void *)pBitmap->pData, pBitmap->BytesPerLine, xSizeScaled, ySizeScaled, Fmt);
    //
    // Configure output buffer.
    //
    _PXP_ConfigOutBufferAuto(x0, y0, xSizeScaled, ySizeScaled);
    //
    // Execute and done.
    //
    _PXP_StartOperation();
  } else {
    _PXP_CheckSizes(pBitmap->XSize, pBitmap->YSize, &Ctx);
    _PXP_ClipSizes(x0, y0, &Ctx);
    //
    // Step 1: Do flipping and/or rotation operation to temp. buffer.
    // Output will be converted into 32bpp pixels.
    //
    NumBytes = (sizeof(U32) * xSizeRU * ySizeRU);
    pBuffer  = _Malloc(NumBytes);
    if (pBuffer == NULL) {
      return 1;
    }
    Pitch = (LCD_GetSwapXY()) ? (sizeof(U32) * ySizeRU) : (sizeof(U32) * xSizeRU);
    //
    // Set flipping mode but no rotation.
    //
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, Rotation, FlipMode);
    //
    // Use temp. buffer as output buffer for this step.
    //
    _PXP_ConfigOutBufferEx(pBuffer, Pitch, pBitmap->XSize, pBitmap->YSize, true, kPXP_OutputPixelFormatARGB8888);
    //
    // Configure bitmap as PS.
    //
    PXP_DisableAlphaSurface();
    _PXP_ConfigProcessSurfaceEx((void *)pBitmap->pData, pBitmap->BytesPerLine, pBitmap->XSize, pBitmap->YSize, Fmt);
    _PXP_StartOperation();
    //
    // Step 2: Scale the flipped bitmap.
    //
    _PXP_InitOperation();
    PXP_SetProcessSurfaceScaler(PXP, pBitmap->XSize, pBitmap->YSize, xSizeScaled, ySizeScaled);
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, kPXP_Rotate0, kPXP_FlipDisable);
    //
    // Configure output buffer.
    //
    _PXP_ConfigOutBufferAuto(x0, y0, xSizeScaled, ySizeScaled);
    //
    // Configure temp. buffer as PS.
    //
    PXP_DisableAlphaSurface();
    _SwapSizesOnDemand(&xSizeScaled, &ySizeScaled); // Swap sizes if required for PS.
    _PXP_ConfigProcessSurfaceEx(pBuffer, Pitch, xSizeScaled, ySizeScaled, kPXP_PsPixelFormatRGB888);
    //
    // We are done, start PXP and free memory.
    //
    _PXP_StartOperation();
  }
  return 0;
}

/*********************************************************************
*
*       Custom color conversions
*/
DEFINE_PXP_COLORCONV(M1555I, kPXP_OutputPixelFormatARGB1555)
DEFINE_PXP_COLORCONV(M565,   kPXP_OutputPixelFormatRGB565)
DEFINE_PXP_COLORCONV(M4444I, kPXP_OutputPixelFormatARGB4444)
DEFINE_PXP_COLORCONV(M8888I, kPXP_OutputPixelFormatARGB8888)
DEFINE_PXP_COLOR2INDEX(M888, kPXP_OutputPixelFormatRGB888P)

/*********************************************************************
*
*       _LCD_PXP_Color2IndexBulk
*/
static void _LCD_PXP_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat) {
  //
  // Set input color buffer as AS so that alpha values are also converted.
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBufferEx(pIndex, NumItems * SizeOfIndex, NumItems, 1, false, PixelFormat);
  _PXP_ConfigAlphaSurface(pColor, NumItems * LCD_BYTES_PER_PIXEL, NumItems, 1);
  _PXP_ConfigAlphaBlendNormal();
  PXP_DisableProcessSurface();
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_Index2ColorBulk
*/
static void _LCD_PXP_Index2ColorBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat) {
  pxp_as_pixel_format_t InputFormat;

  //
  // Convert given parameter to input format.
  //
  switch (PixelFormat) {
  case kPXP_OutputPixelFormatARGB1555:
    InputFormat = kPXP_AsPixelFormatARGB1555;
    break;
  case kPXP_OutputPixelFormatRGB565:
    InputFormat = kPXP_AsPixelFormatRGB565;
    break;
  case kPXP_OutputPixelFormatARGB4444:
    InputFormat = kPXP_AsPixelFormatARGB4444;
    break;
  default:
  case kPXP_OutputPixelFormatARGB8888:
    InputFormat = kPXP_AsPixelFormatARGB8888;
    break;
  }
  //
  // No AS needed.
  // Configure input colors as PS.
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBuffer(pColor, NumItems * LCD_BYTES_PER_PIXEL, NumItems, 1, true);
  PXP_DisableProcessSurface();
  _PXP_ConfigAlphaSurfaceEx(pIndex, NumItems * SizeOfIndex, NumItems, 1, InputFormat);
  _PXP_ConfigAlphaBlendNormal();
  _PXP_StartOperation();
}

/*********************************************************************
*
*       Static code: Display init
*
**********************************************************************
*/
/*********************************************************************
*
*       _InitPins
*/
static void _InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);                       // iomuxc clock (iomuxc_clk_enable): 0x03u

  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_00_LCD_CLK, 0U);        // GPIO_B0_00 is configured as LCD_CLK
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_01_LCD_ENABLE, 0U);     // GPIO_B0_01 is configured as LCD_ENABLE
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_02_LCD_HSYNC, 0U);      // GPIO_B0_02 is configured as LCD_HSYNC
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_03_LCD_VSYNC, 0U);      // GPIO_B0_03 is configured as LCD_VSYNC
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_04_LCD_DATA00, 0U);     // GPIO_B0_04 is configured as LCD_DATA00
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_05_LCD_DATA01, 0U);     // GPIO_B0_05 is configured as LCD_DATA01
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_06_LCD_DATA02, 0U);     // GPIO_B0_06 is configured as LCD_DATA02
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_07_LCD_DATA03, 0U);     // GPIO_B0_07 is configured as LCD_DATA03
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_08_LCD_DATA04, 0U);     // GPIO_B0_08 is configured as LCD_DATA04
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_09_LCD_DATA05, 0U);     // GPIO_B0_09 is configured as LCD_DATA05
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_10_LCD_DATA06, 0U);     // GPIO_B0_10 is configured as LCD_DATA06
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_11_LCD_DATA07, 0U);     // GPIO_B0_11 is configured as LCD_DATA07
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_12_LCD_DATA08, 0U);     // GPIO_B0_12 is configured as LCD_DATA08
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_13_LCD_DATA09, 0U);     // GPIO_B0_13 is configured as LCD_DATA09
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_14_LCD_DATA10, 0U);     // GPIO_B0_14 is configured as LCD_DATA10
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_15_LCD_DATA11, 0U);     // GPIO_B0_15 is configured as LCD_DATA11
  IOMUXC_SetPinMux(IOMUXC_GPIO_B1_00_LCD_DATA12, 0U);     // GPIO_B1_00 is configured as LCD_DATA12
  IOMUXC_SetPinMux(IOMUXC_GPIO_B1_01_LCD_DATA13, 0U);     // GPIO_B1_01 is configured as LCD_DATA13
  IOMUXC_SetPinMux(IOMUXC_GPIO_B1_02_LCD_DATA14, 0U);     // GPIO_B1_02 is configured as LCD_DATA14
  IOMUXC_SetPinMux(IOMUXC_GPIO_B1_03_LCD_DATA15, 0U);     // GPIO_B1_03 is configured as LCD_DATA15

  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_00_LCD_CLK,       0x01B0B0u);  // GPIO_B0_00 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_01_LCD_ENABLE,    0x01B0B0u);  // GPIO_B0_01 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_02_LCD_HSYNC,     0x01B0B0u);  // GPIO_B0_02 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_03_LCD_VSYNC,     0x01B0B0u);  // GPIO_B0_03 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_04_LCD_DATA00,    0x01B0B0u);  // GPIO_B0_04 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_05_LCD_DATA01,    0x01B0B0u);  // GPIO_B0_05 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_06_LCD_DATA02,    0x01B0B0u);  // GPIO_B0_06 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_07_LCD_DATA03,    0x01B0B0u);  // GPIO_B0_07 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_08_LCD_DATA04,    0x01B0B0u);  // GPIO_B0_08 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_09_LCD_DATA05,    0x01B0B0u);  // GPIO_B0_09 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_10_LCD_DATA06,    0x01B0B0u);  // GPIO_B0_10 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_11_LCD_DATA07,    0x01B0B0u);  // GPIO_B0_11 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_12_LCD_DATA08,    0x01B0B0u);  // GPIO_B0_12 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_13_LCD_DATA09,    0x01B0B0u);  // GPIO_B0_13 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_14_LCD_DATA10,    0x01B0B0u);  // GPIO_B0_14 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_15_LCD_DATA11,    0x01B0B0u);  // GPIO_B0_15 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_00_LCD_DATA12,    0x01B0B0u);  // GPIO_B1_00 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_01_LCD_DATA13,    0x01B0B0u);  // GPIO_B1_01 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_02_LCD_DATA14,    0x01B0B0u);  // GPIO_B1_02 PAD functional properties
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_03_LCD_DATA15,    0x01B0B0u);  // GPIO_B1_03 PAD functional properties
}

/*********************************************************************
*
*       _BootClockRUN
*/
static void _BootClockRUN(void) {
  //
  // Boot ROM did initialize the XTAL, here we only sets external XTAL OSC freq
  //
  CLOCK_SetXtalFreq(24000000U);
  CLOCK_SetRtcXtalFreq(32768U);
  CLOCK_SetMux(kCLOCK_PeriphClk2Mux, 0x1);                                  // Set PERIPH_CLK2 MUX to OSC
  CLOCK_SetMux(kCLOCK_PeriphMux, 0x1);                                      // Set PERIPH_CLK MUX to PERIPH_CLK2
  DCDC->REG3 = (DCDC->REG3 & (~DCDC_REG3_TRG_MASK)) | DCDC_REG3_TRG(0x12);
  CLOCK_InitArmPll(&armPllConfig);                                          // Configure ARM PLL to 1200M
  CLOCK_InitSysPll(&sysPllConfig);                                          // Configure SYS PLL to 528M
  CLOCK_SetDiv(kCLOCK_ArmDiv, 0x1);                                         // Set ARM PODF to 1, divide by 2
  CLOCK_SetDiv(kCLOCK_AhbDiv, 0x0);                                         // Set AHB PODF to 0, divide by 1
  CLOCK_SetMux(kCLOCK_PrePeriphMux, 0x3);                                   // Set PRE_PERIPH_CLK to PLL1, 1200M
  CLOCK_SetMux(kCLOCK_PeriphMux, 0x0);                                      // Set PERIPH_CLK MUX to PRE_PERIPH_CLK
  SystemCoreClockUpdate();
}

/*********************************************************************
*
*       _LCDOnOff
*/
static void _LCDOnOff(int OnOff) {
  gpio_pin_config_t config = {
    kGPIO_DigitalOutput, 0, 0,
  };
  //
  // Backlight
  //
  config.outputLogic = OnOff;
  GPIO_PinInit(LCD_BL_GPIO, LCD_BL_GPIO_PIN, &config);
}

/*********************************************************************
*
*       _InitPixelClock
*/
static void _InitPixelClock(void) {
    clock_video_pll_config_t config = {
        .loopDivider = 31, .postDivider = 8, .numerator = 0, .denominator = 0,
    };
    CLOCK_InitVideoPll(&config);
    CLOCK_SetMux(kCLOCK_LcdifPreMux, 2);
    CLOCK_SetDiv(kCLOCK_LcdifPreDiv, 4);
    CLOCK_SetDiv(kCLOCK_LcdifDiv, 1);
}

/*********************************************************************
*
*       _InitController
*
* Purpose:
*   Should initialize the display controller
*/
static void _InitController(void) {
  static U8 Done;
  U32     * pLCD_read_qos = (U32 *)0x41044100;
  const elcdif_rgb_mode_config_t LCDConfig = {
    .panelWidth = XSIZE_PHYS,
    .panelHeight = YSIZE_PHYS,
    .hsw = LCD_HSW,
    .hfp = LCD_HFP,
    .hbp = LCD_HBP,
    .vsw = LCD_VSW,
    .vfp = LCD_VFP,
    .vbp = LCD_VBP,
    .polarityFlags = LCD_POL_FLAGS,
    .bufferAddr = VRAM_ADDR,
    .pixelFormat = PIXEL_FORMAT,
    .dataBus = LCD_DATA_BUS_WIDTH,
  };
  gpio_pin_config_t GPIOConfig = {
    kGPIO_DigitalOutput, 0, 0,
  };
  
  if (Done == 0) {
#if (USE_OS == 1)
    _Semaphore_Create(&_hSema_WaitForPXP);
    _Semaphore_Create(&_hSema_WaitForVSYNC);
#endif
    _InitPins();
    _BootClockRUN();
    //
    // Only enable if the clocks are not properly setup before.
    // If the clocks are properly configured a re-init will 
    // cause the device to reboot and will never get out of this.
    //
    _InitPixelClock();
    //
    // Reset the LCD
    //
    GPIO_PinInit(LCD_DISP_GPIO, LCD_DISP_GPIO_PIN, &GPIOConfig);
    GPIO_WritePinOutput(LCD_DISP_GPIO, LCD_DISP_GPIO_PIN, 0);
    GUI_X_Delay(5);
    GPIO_WritePinOutput(LCD_DISP_GPIO, LCD_DISP_GPIO_PIN, 1);
    //
    // Init LCD controller
    //
    ELCDIF_RgbModeInit(LCDIF, &LCDConfig);
    //
    // Enable VSYNC interrupt
    //
    EnableIRQ(LCDIF_IRQn);
    ELCDIF_EnableInterrupts(LCDIF, kELCDIF_CurFrameDoneInterruptEnable);
    NVIC_EnableIRQ(LCDIF_IRQn);
    NVIC_SetPriority(LCDIF_IRQn, 0xf);
    ELCDIF_RgbModeStart(LCDIF);
    //
    // Increase priority of LCD master read. Default priority is 1 which causes screen
    // shifting issues.
    // Highest priority is 15. If the below priority causes issues with other peripherals it
    // could be lowered. Reference: https://community.nxp.com/t5/i-MX-RT/iMXRT1052-LCD-Screen-shifted/td-p/1069978
    //
    *pLCD_read_qos = 5;
    //
    // Init PXP
    //
    PXP_Init(PXP);
    PXP_READ_QOS = 15;
#if (USE_OS == 1)
    NVIC_EnableIRQ(PXP_IRQn);
    NVIC_SetPriority(PXP_IRQn, 0xf);
    PXP_EnableInterrupts( PXP, kPXP_CompleteInterruptEnable );
#endif
    Done = 1;
  }
}

/*********************************************************************
*
*       _ClearCache
*/
static void _ClearCache(U32 v) {
  GUI_USE_PARA(v);
  SCB_CleanInvalidateDCache();
}

#if (USE_OS == 1)
/*********************************************************************
*
*       PXP_IRQHandler
*/
void PXP_IRQHandler(void);
void PXP_IRQHandler(void) {
  if (PXP_GetStatusFlags( PXP ) & kPXP_CompleteFlag ) {
    PXP_ClearStatusFlags( PXP, kPXP_CompleteFlag );
    _Semaphore_Give(_hSema_WaitForPXP);
  }
}
#endif

/*********************************************************************
*
*       LCDIF_IRQHandler
*/
void LCDIF_IRQHandler(void);
void LCDIF_IRQHandler(void) {
  U32 InterruptStatus;
  //
  // Get and clear interrupt status
  //
  InterruptStatus = ELCDIF_GetInterruptStatus(LCDIF);
  ELCDIF_ClearInterruptStatus(LCDIF, InterruptStatus);
  //
  // If frame is done and pending buffer is not -1 confirm buffer
  //
  if (InterruptStatus & kELCDIF_CurFrameDone) {
    if (_PendingBuffer >= 0) {
      GUI_MULTIBUF_Confirm(_PendingBuffer);
#if (USE_OS == 1)
      _Semaphore_Give(_hSema_WaitForVSYNC);
#endif
      _PendingBuffer = -1;
    }
  }
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}

/*********************************************************************
*
*       _SwitchBuffer
*/
static void _SwitchBuffer(int Index) {
  U32 Addr;
  //
  // Calculate address of buffer to be used  as visible frame buffer
  //
  Addr = _aBufferAddress[Index];
  //
  // Reload configuration
  //
  ELCDIF_SetNextBufferAddr(LCDIF, Addr);
  //
  // Tell emWin that buffer is used
  //
  _PendingBuffer = Index;
#if (USE_OS == 1)
  _Semaphore_Take(_hSema_WaitForVSYNC);
#else
  while (_PendingBuffer >= 0) {
  }
#endif
}

/*********************************************************************
*
*       _ConfigDriver
*
* Purpose:
*   Called from LCD_ROTATE_SetSelEx() after a new driver has been selected in order to
*   configure the new driver.
*/
static void _ConfigDriver(GUI_DEVICE * pDevice, int Index, int LayerIndex) {
  GUI_USE_PARA(Index);
  GUI_USE_PARA(LayerIndex);
  //
  // Display driver configuration
  //
  if (LCD_GetSwapXY()) {
    LCD_SetSizeEx (0, YSIZE_PHYS, XSIZE_PHYS);
    LCD_SetVSizeEx(0, YSIZE_PHYS, XSIZE_PHYS);
  } else {
    LCD_SetSizeEx (0, XSIZE_PHYS, YSIZE_PHYS);
    LCD_SetVSizeEx(0, XSIZE_PHYS, YSIZE_PHYS);
  }
  LCD_SetVRAMAddrEx(0, (void *)_aBufferAddress[0]);
  //
  // Enable PXP accelerator
  //
  LCD_PXP_Enable(1);
  //
  // Update the current display rotation angle for PXP.
  //
  if      ((pDevice->pDeviceAPI == GUIDRV_LIN_32)     || (pDevice->pDeviceAPI == GUIDRV_LIN_16))     {
    _PXP_Rotation = kPXP_Rotate0;
  }
  else if ((pDevice->pDeviceAPI == GUIDRV_LIN_OSX_32) || (pDevice->pDeviceAPI == GUIDRV_LIN_OSX_16)) {
    _PXP_Rotation = kPXP_Rotate90;
  }
  else if ((pDevice->pDeviceAPI == GUIDRV_LIN_OXY_32) || (pDevice->pDeviceAPI == GUIDRV_LIN_OXY_16)) {
    _PXP_Rotation = kPXP_Rotate180;
  }
  else if ((pDevice->pDeviceAPI == GUIDRV_LIN_OSY_32) || (pDevice->pDeviceAPI == GUIDRV_LIN_OSY_16)) {
    _PXP_Rotation = kPXP_Rotate270;
  }
}

/*********************************************************************
*
*       Public code
*
**********************************************************************
*/
/*********************************************************************
*
*       LCD_PXP_Enable
*/
void LCD_PXP_Enable(int Enable) {
  if (Enable) {
    GUI_AlphaEnableFillRectHW(1);
    LCD_SetDevFunc(0, LCD_DEVFUNC_FILLRECT,      (void(*)(void))_LCD_PXP_FillRect);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYBUFFER,    (void(*)(void))_LCD_PXP_CopyBuffer);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYRECT,      (void(*)(void))_LCD_PXP_CopyRect);
    //
    // Set up functions for drawing bitmaps and memory devices with PXP
    //
    GUI_SetFuncDrawBitmapEx   (_LCD_PXP_DrawBitmapEx);
    GUI_SetFuncMixColorsBulk  (_LCD_PXP_MixColorsBulk);
    GUI_SetFuncDrawAlpha      (_LCD_PXP_DrawMemdevAlpha,
        (GUI_DRAWBITMAP_FUNC *)_LCD_PXP_DrawBitmap32bpp);
#if GUI_SUPPORT_MEMDEV
#if GUI_MEMDEV_SUPPORT_CUSTOMDRAW
    GUI_MEMDEV_SetDrawMemdev16bppFunc(_LCD_PXP_DrawMemdev16bpp);
#endif
    GUI_SetFuncDrawM565       (_LCD_PXP_DrawMemdevM565,
                               _LCD_PXP_DrawBitmapM565);
    //
    // Memdev manupulation functions with PXP
    //
    GUI_MEMDEV_SetBlendFunc   (_LCD_PXP_BlendMemdev);
#endif
    //
    // Color conversion functions
    //
    GUI_PXP_SETCOLORCONV(M1555I);
    GUI_PXP_SETCOLORCONV(M565);
    GUI_PXP_SETCOLORCONV(M4444I);
    GUI_PXP_SETCOLORCONV(M8888I);
    GUICC_M888_SetCustColorConv(_LCD_PXP_Color2IndexBulk_M888, NULL);
  } else {
    GUI_AlphaEnableFillRectHW(0);
    LCD_SetDevFunc(0, LCD_DEVFUNC_FILLRECT,      (void(*)(void))NULL);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYBUFFER,    (void(*)(void))NULL);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYRECT,      (void(*)(void))NULL);
    //
    // Clear functions for drawing bitmaps and memory devices with PXP
    //
    GUI_SetFuncDrawBitmapEx   (NULL);
    GUI_SetFuncMixColorsBulk  (NULL);
    GUI_SetFuncDrawAlpha      (NULL,
        (GUI_DRAWBITMAP_FUNC *)NULL);
#if GUI_SUPPORT_MEMDEV
#if GUI_MEMDEV_SUPPORT_CUSTOMDRAW
    GUI_MEMDEV_SetDrawMemdev16bppFunc(NULL);
#endif
    GUI_SetFuncDrawM565       (NULL,
                               NULL);
    //
    // Memdev manupulation functions with PXP
    //
    GUI_MEMDEV_SetBlendFunc   (NULL);
#endif
    //
    // Color conversion functions
    //
    GUICC_M1555I_SetCustColorConv(NULL, NULL);
    GUICC_M565_SetCustColorConv  (NULL, NULL);
    GUICC_M4444I_SetCustColorConv(NULL, NULL);
    GUICC_M8888I_SetCustColorConv(NULL, NULL);
    GUICC_M888_SetCustColorConv  (NULL, NULL);
  }
}

/*********************************************************************
*
*       LCD_X_Config
*
* Purpose:
*   Called during the initialization process in order to set up the
*   display driver configuration.
*
*/
void LCD_X_Config(void) {
  GUI_DEVICE * pDevice;

