SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1052_EVK/LCDConf.c
#if (NUM_BUFFERS > 1)
  GUI_MULTIBUF_Config(NUM_BUFFERS);
#endif
  //
  // Set display driver and color conversion for 1st layer
  //
  pDevice = GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER, COLOR_CONVERSION, 0, 0);
  //
  // Configure the initial driver
  //
  _ConfigDriver(pDevice, 0, GUI_ROTATION_0);
  //
  // If screen rotation is not required the following section could be switched off to spare ROM
  //
#if ENABLE_DISPLAY_ROTATION
  //
  // Create additional drivers and add them to the display rotation module
  //
  LCD_ROTATE_AddDriverExOrientation(DISPLAY_DRIVER_CCW, 0, GUI_ROTATION_CCW);
  LCD_ROTATE_AddDriverExOrientation(DISPLAY_DRIVER_180, 0, GUI_ROTATION_180);
  LCD_ROTATE_AddDriverExOrientation(DISPLAY_DRIVER_CW,  0, GUI_ROTATION_CW);
  //
  // Set callback function to be used for layer 0
  //
  LCD_ROTATE_SetCallback(_ConfigDriver, 0);
#endif
  //
  // Cache management
  //
  GUI_DCACHE_SetClearCacheHook(_ClearCache);
}

/*********************************************************************
*
*       LCD_X_DisplayDriver
*
* Purpose:
*   This function is called by the display driver for several purposes.
*   To support the according task the routine needs to be adapted to
*   the display controller. Please note that the commands marked with
*   'optional' are not cogently required and should only be adapted if
*   the display controller supports these features.
*
* Parameter:
*   LayerIndex - Index of layer to be configured
*   Cmd        - Please refer to the details in the switch statement below
*   pData      - Pointer to a LCD_X_DATA structure
*
* Return Value:
*   < -1 - Error
*     -1 - Command not handled
*      0 - Ok
*/
int LCD_X_DisplayDriver(unsigned LayerIndex, unsigned Cmd, void * pData) {
  int r;

  GUI_USE_PARA(LayerIndex);
  switch (Cmd) {
  //
  // Required
  //
  case LCD_X_INITCONTROLLER: {
    //
    // Called during the initialization process in order to set up the
    // display controller and put it into operation. If the display
    // controller is not initialized by any external routine this needs
    // to be adapted by the customer...
    //
    _InitController();
    return 0;
  }
  case LCD_X_SHOWBUFFER: {
    LCD_X_SHOWBUFFER_INFO * pInfo;

    pInfo = (LCD_X_SHOWBUFFER_INFO *)pData;
    _SwitchBuffer(pInfo->Index);
    return 0;
  }
  case LCD_X_ON: {
    _LCDOnOff(1);
    return 0;
  }
  case LCD_X_OFF: {
    _LCDOnOff(0);
    return 0;
  }
  default:
    r = -1;
  }
  return r;
}

/*************************** End of file ****************************/
